def lvl_1():
    s = str("пРиВет МИР")
    print(
        "Вы выбрали 1 уровень. На этом уровень Вы можете к вписанной строке применить методы upper(), lower(), capitalize()")
    print(
        "Метод lower() принимает на вход строку. Он меняет регистр всех букв введенной строки на нижний (если он есть) и возвращает измененную строку")
    print("То есть если у нас есть строка", s, ", то применение к ней метода", "lower()", "выдаст>>>", s.lower())
    print(
        "Метод upper() принимает на вход строку. Он меняет регистр всех букв введенной строки на верхний (если он есть) и возвращает измененную строку")
    print("То есть если у нас есть строка", s, ", то применение к ней метода", "upper()", "выдаст>>>", s.upper())
    print(
        "Метод capitalize() принимает на вход строку. Метод capitalize() в Python преобразует строку так, что первая буква становится заглавной, а все остальные — строчными")
    print("То есть если у нас есть строка", s, ", то применение к ней метода", "capitalize()", "выдаст>>>",
          s.capitalize())
    print("Теперь вводите строки и цифры, отвечающие за метод. Если хотите прекратить - введите 0")
    print("Цифра 1 - использование метода lower(), 2 - upper(), 3 - capitalize()")
    while True:
        st = str(input("введите строку>>>"))
        if st == "0":
            break
        else:
            c = int(input(("Введите цифру, отвечающую за выбор метода>>>")))
            if c == 1: print(st.lower())
            if c == 2: print(st.upper())
            if c == 3: print(st.capitalize())
    return 0


def lvl_2():
    s = str("Ботать это круто. Очень круто")
    print(
        "Вы выбрали 2 уровень. На этом уровне Вы можете к вписанной строке применить методы find(), replace(), count()")

    print('''Метод find для строк ищет первое вхождение заданной подстроки и возвращает индекс (позицию) её начала (ее первого символа). Нумерация символов - слева-направо, с нуля. Если подстрока не найдена, метод возвращает -1. Синтаксис>>>строка.find(sub,start,end): Метод принимает три аргумента: sub — обязательный. Подстрока, которую нужно найти. start — необязательный. Указывает позицию, с которой начинать поиск. По умолчанию равен 0. end — необязательный. Задаёт позицию, на которой поиск заканчивается (не включая его). По умолчанию равен длине строки.''')
    t = s.find("круто")
    print(f'То есть если у нас есть строка "{s}", то применение к ней метода find() с аргументом "круто" выдаст>>> {t}')
    print('''Метод count принимает до трёх аргументов, первый (sub) - обязательный, остальные(start, end) - опциональные: sub (подстрока) - обязательный. Это то, что ищем. Может быть одним символом или целым словом.
start - необязательный. Индекс, с которого начинать поиск (включительно). По умолчанию 0 (начало строки). end — необязательный. Индекс, где поиск заканчивается (не включая эту позицию). По умолчанию — конец строки.
Синтаксис>>>строка.count(sub, start, end). Метод возвращает целое число (int) — количество непересекающихся вхождений подстроки в указанном диапазоне. Если подстрока найдена несколько раз — вернёт это число. Если не найдена ни разу — вернёт 0''')
    t = s.count("о")
    print(f'То есть если у нас есть строка "{s}", то применение к ней метода count() с аргументом "о" выдаст>>> {t}')

    print(
        '''Метод replace() принимает подстроку для замены (old), новую подстроку (new) и опционально — макс. число замен (count); синтаксис: строка.replace(old, new, count); возвращает новую строку с выполненными заменами (исходная не меняется)''')
    t = s.replace("круто", "антихайп")
    print(
        f'То есть если у нас есть строка "{s}", то применение к ней метода replace() с аргументами ("круто", "антихайп") выдаст>>> {t}')
    print("Теперь вводите строки и цифры, отвечающие за метод. Если хотите прекратить - введите 0")
    print("Цифра 1 - использование метода find(), 2 - count(), 3 - replace()")
    while True:
        st = str(input("введите строку>>>"))
        if st == "0":
            break
        else:
            c = int(input(("Введите цифру, отвечающую за выбор метода>>>")))
            if c == 1:
                r=str(input("Введите подстроку, первый индекс которой Вы хотите найти>>>"))
                print(st.find(f'{r}'))
            if c==2:
                r = str(input("Введите подстроку, число вхождений которой в исходную строку Вы хотите посчитать>>>"))
                print(st.count(f'{r}'))
            if c==3:
                old=str(input("Введите подстроку, которую хотите заменить>>>"))
                new=str(input("Введите подстроку, на которую хотите заменить>>>"))
                print(st.replace(old,new))
    return 0


def lvl_3():
    print(
        'Вы выбрали 3 уровень. Здесь вы познакомитесь с методами join(), split(), а также увидите реализацию join()+split()')
    print(
        'Метод join() принимает последовательность строк (или строку посимвольно), вставляет строку-разделитель между её элементами и возвращает одну новую объединенную строку. Синтаксис: разделитель.join(последовательность), где разделитель — строка, которая будет вставлена между элементами. последовательность — список, кортеж или любой другой итерируемый объект, содержащий только строки.')
    print('''Например, если есть список ['1','2','3','4'], то использование метода join() с аргументом ";" выдаст>>>''',
          ';'.join(['1', '2', '3', '4']))
    print(
        'Метод split() принимает строку-разделитель (и необязательный лимит разбиений), разбивает исходную строку в местах совпадения с разделителем и возвращает список полученных подстрок. Синтаксис: строка.split(разделитель, maxsplit), где разделитель — символ или подстрока, по которой делится текст (по умолчанию — любые пробелы), а maxsplit — максимальное количество разделений.')
    print('''Например, если есть строка '1,2,3,4', то использование метода split() с аргументом "," выдаст>>>''',
          '1,2,3,4'.split(','))
    print(
        '''Можно комбинировать join() и split(). Например, если есть строка s='1,2,3,4', то применение в виде 'GG'.join(s.split(',')) вернет''',
        'GG'.join('1,2,3,4'.split(',')))
    print(
        'Теперь выберите то, что хотите протестировать. Для этого напишите 1, или 2, или 3 соответственно для манипуляций, представленных выше>>>')
    t = 1
    while t != 0:
        t = int(input())
        if t == 1:
            s = input('Введите элементы без пробела>>>')
            r = input('Выберите разделитель>>>')
            print('Результат>>>', r.join(s))
        if t == 2:
            s = input('Введите строку>>')
            r = input('Выберите разделитель>>>')
            print('Результат>>>', s.split(r))
        if t == 3:
            s = input('Введите элементы без пробела>>>')
            r1 = input('Выберите разделитель для split()>>>')
            r2 = input('Выберите разделитель join()>>>')
            print('Результат>>>', r2.join(s.split(r1)))
    return 0


def lvl_4():
    print('Вы выбрали 4 уровень. Здесь вы познакомитесь с методами isdigit(), isalpha() и strip()')
    print(
        'Метод isdigit() не принимает аргументов, проверяет, состоит ли строка только из цифр, и возвращает логическое значение True или False (если строка состоит только из целых положительных цифр - True, иначе - False). Синтаксис: строка.isdigit(), где метод вызывается у проверяемой строки.')
    print('''Например, если есть строка '1234*?%^$', то использование метода isdigit() выдаст>>>''',
          '1234*?%^$'.isdigit())
    print(
        'Метод isalpha() не принимает аргументов, проверяет, состоит ли строка только из букв, и возвращает логическое значение True или False. Синтаксис: строка.isalpha(), где метод вызывается у проверяемой строки.')
    print('''Например, если есть строка '    abc1234   ', то использование метода isalpha() выдаст>>>''',
          '    abc1234   '.isalpha())
    print(
        'Метод strip() принимает необязательную строку с набором знаков, удаляет эти символы (или пробелы по умолчанию) в начале и в конце строки и возвращает её очищенную копию. Синтаксис: строка.strip(символы), где символы — строка, содержащая символы для удаления.')
    print('''Например, если есть строка '   abc1234   ', то использование метода strip() выдаст>>>''',
          '    abc1234   '.strip())
    print(
        'Теперь выберите то, что хотите протестировать. Для этого напишите 1, или 2, или 3 соответственно для манипуляций, представленных выше>>>')
    t = 1
    while t != 0:
        t = int(input())
        if t == 1:
            s = input('Введите строку>>>')
            print('Результат>>>', s.isdigit())
        if t == 2:
            s = input('Введите строку>>>')
            print('Результат>>>', s.isalpha())
        if t == 3:
            s = input('Введите строку>>>')
            r = input('Введите символы для удаления>>>')
            print('Результат>>>', s.strip(r))
    return 0


def lvl_5():
    print(
        '''Вы выбрали 5 уровень. Здесь вы увидите, что даже строчку '     pYtHonis;AWESome' можно сделать красивой, используя только методы строк''')
    s = '     pYtHonis;AWESome'
    s = s.replace(' ', '')
    s = s.capitalize()
    s = s.replace(';', '')
    s = s.split('n')
    s = 'n '.join(s)
    s = s.split('s')
    s = 's '.join(s)
    s = s.replace(' ome', 'ome')
    print(s)
    return 0


while True:
    lvl = int(input(("Выберите уровень (от 1 до 5) или 0 для выхода из игры>>>")))
    
    if lvl == 0:
        print("Вы завершили игру. До свидания!")
        break
    elif lvl == 1:
        lvl_1()
    elif lvl == 2:
        lvl_2()
    elif lvl == 3:
        lvl_3()
    elif lvl == 4:
        lvl_4()
    elif lvl == 5:
        lvl_5()
